       01   wf-opcoes-frame.
            03 wf-frame                            pic 9(02).
               88 wf-frame-retornar                    value 99.
            03 wf-opcao                            pic 9(02).
               88 wf-opcao-retornar                    value 99.        
       
      


