       fd   pd00900.
       
       01   f00900-usuario-empresa.
            03 f00900-id-usuario                   pic 9(11).
            03 f00900-cd-empresa                   pic 9(03).
            03 f00900-cd-filial                    pic 9(04).     


