       fd   pd00600.
       
       01   f00600-logradouro.
            03 f00600-cd-empresa                   pic 9(03).
            03 f00600-cd-filial                    pic 9(04).
            03 f00600-id-logradouro                pic 9(09).
            03 f00600-cep                          pic 9(08).
            03 f00600-nome-logradouro              pic x(55).
            03 f00600-id-bairro                    pic 9(09).


