       fd   pd00400.
       
       01   f00400-municipio.
            03 f00400-cd-empresa                   pic 9(03).
            03 f00400-cd-filial                    pic 9(04).
            03 f00400-id-municipio                 pic 9(09).
            03 f00400-cd-municipio                 pic 9(07).
            03 f00400-nome-municipio               pic x(55).
            03 f00400-id-estado                    pic 9(09). 
       
      


