       
       fd   pd02200.

       01   f02200-parametros-nfe.
            03 f02200-cd-empresa                   pic 9(03).
            03 f02200-cd-filial                    pic 9(04).
            03 f02200-numero-documento             pic 9(09).
            03 f02200-serie-documento              pic 9(03).
