       fd   pd01200.
       
       01   f01200-usuario-perfil.
            03 f01200-cd-empresa                   pic 9(03).
            03 f01200-cd-filial                    pic 9(04).
            03 f01200-id-usuario                   pic 9(11).
            03 f01200-cd-perfil                    pic 9(03).
            
