          fd   pd06000.
       
       01   f06000-estoque.
            03 f06000-cd-empresa                   pic 9(03).
            03 f06000-cd-filial                    pic 9(04).
            03 f06000-cd-produto                   pic 9(09).
            03 f06000-qtde-disponivel              pic s9(09)v9(04).
            03 f06000-qtde-reservada               pic s9(09)v9(04).      


