       fd   pd00500.
       
       01   f00500-bairro.
            03 f00500-cd-empresa                   pic 9(03).
            03 f00500-cd-filial                    pic 9(04).
            03 f00500-id-bairro                    pic 9(09).
            03 f00500-cd-bairro                    pic 9(10).
            03 f00500-nome-bairro                  pic x(55).
            03 f00500-id-municipio                 pic 9(09).
      


