       fd   pd00000.
       
       01   f00000-programas.
            03 f00000-cd-programa                  pic x(08).
            03 f00000-descricao-programa           pic x(55).             
            
           
      


