       fd   pd00200.
       
       01   f00200-pais.
            03 f00200-cd-empresa                   pic 9(03).
            03 f00200-cd-filial                    pic 9(04).
            03 f00200-id-pais                      pic 9(09).
            03 f00200-cd-pais                      pic 9(04).
            03 f00200-nome-pais                    pic x(55).
       
      


