       fd   pd01000.
       
       01   f01000-perfil.
            03 f01000-cd-empresa                   pic 9(03).
            03 f01000-cd-filial                    pic 9(04).
            03 f01000-cd-perfil                    pic 9(03).
            03 f01000-descricao-perfil             pic x(55).