       fd   pd00300.
       
       01   f00300-estado.
            03 f00300-cd-empresa                   pic 9(03).
            03 f00300-cd-filial                    pic 9(04).
            03 f00300-id-estado                    pic 9(09).
            03 f00300-cd-estado                    pic 9(02).
            03 f00300-nome-estado                  pic x(55).
            03 f00300-sigla-estado                 pic x(02).
            03 f00300-id-pais                      pic 9(09).
      


