            select pd00000 assign to disk wid-pd00000
                 organization        is indexed
                 access mode         is dynamic
                 record key          is f00000-chave =
                                        f00000-cd-programa
                 lock mode           is manual
                 file status         is ws-resultado-acesso.
