           select pd05000 assign to disk wid-pd05000
                organization        is indexed
                access mode         is dynamic
                record key          is f05000-chave                                                                                     
                lock mode           is manual
                file status         is ws-resultado-acesso.
      


