           select pd02200 assign to disk wid-pd02200
                organization        is indexed
                access mode         is dynamic
                record key          is f02200-chave = 
                                       f02200-cd-empresa
                                       f02200-cd-filial                                
                lock mode           is manual
                file status         is ws-resultado-acesso.

      


