           select pd05100 assign to disk wid-pd05100
                organization        is indexed
                access mode         is dynamic
                record key          is f05100-chave                                                                                     
                lock mode           is manual
                file status         is ws-resultado-acesso.
      


